scripts/UC_2_buyItem/result1/Iteration9/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>James785</ns2:safePayUsername><ns2:safePayPassword>b806390dd6c05b44db179af04e2251b195a6af8f</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886234567890123</ns2:cardNumber><ns2:expirationDate>042029</ns2:expirationDate><ns2:cvvNumber>512</ns2:cvvNumber><ns2:customerName>James Wilson</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>